 # Laboratorium 3
 ## Marcin Biela, gr1b
 ### Połączenie z bazą danych przy pomocy sqlAlchemy

In [74]:
from sqlalchemy import create_engine
import pandas as pd
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

# Pobierz te biblioteki u siebie
# pip install sqlalchemy
# pip install psycopg2-binary

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

## Zadanie 1: Ile kategorii filmów mamy w wypożyczalni

In [75]:
querry_1: str = "SELECT DISTINCT name, last_update FROM category ORDER BY name ASC"
df_1 = pd.read_sql(querry_1, con=connection_sqlalchemy)
df_1

           name         last_update
0        Action 2006-02-15 09:46:27
1     Animation 2006-02-15 09:46:27
2      Children 2006-02-15 09:46:27
3      Classics 2006-02-15 09:46:27
4        Comedy 2006-02-15 09:46:27
5   Documentary 2006-02-15 09:46:27
6         Drama 2006-02-15 09:46:27
7        Family 2006-02-15 09:46:27
8       Foreign 2006-02-15 09:46:27
9         Games 2006-02-15 09:46:27
10       Horror 2006-02-15 09:46:27
11        Music 2006-02-15 09:46:27
12          New 2006-02-15 09:46:27
13       Sci-Fi 2006-02-15 09:46:27
14       Sports 2006-02-15 09:46:27
15       Travel 2006-02-15 09:46:27

In [76]:
category_count = df_1[df_1.columns[0]].count()
print(f"Mamy {category_count} kategorii filmów")

Mamy 16 kategorii filmów

## Zadanie 2: Wyświetl listę kategorii w kolejności alfabetycznej

In [77]:
querry_2: str = 'SELECT name FROM category ORDER BY name ASC'
category_alphabet = pd.read_sql(querry_2, con=connection_sqlalchemy)
category_alphabet

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 3: Znajdź najstarszy i najmłodszy film do wypożyczenia

In [78]:
querry_3: str = "SELECT DISTINCT ON (release_year) release_year, title FROM film ORDER BY release_year ASC"
film_to_borrowed = pd.read_sql(querry_3, con=connection_sqlalchemy)
film_to_borrowed
# Wszystkie daty wyporzyczenia filmów są takie same, stwierdziłem to po tym, że procedura select distinct pomija wszystkie zdublowane recordy w 
# naszym przypadku został tylko jeden.

   release_year            title
0          2006  Chamber Italian

## Zadanie 4: Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [79]:
querry_4: str = "SELECT rental_date FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-02'"
film_borrowed_between_07_08 = pd.read_sql(querry_4, con=connection_sqlalchemy)
film_borrowed_between_07_08

             rental_date
0    2005-07-05 22:49:24
1    2005-07-05 22:51:44
2    2005-07-05 22:56:33
3    2005-07-05 22:57:34
4    2005-07-05 22:59:53
...                  ...
7375 2005-08-01 23:49:33
7376 2005-08-01 23:50:22
7377 2005-08-01 23:51:00
7378 2005-08-01 23:53:45
7379 2005-08-01 23:58:45

[7380 rows x 1 columns]

In [80]:
n_borrowed_between_07_08 = film_borrowed_between_07_08[film_borrowed_between_07_08.columns[0]].count()
print(f"Między 2005-07-01 a 2005-08-01 wyporzyczone {n_borrowed_between_07_08} filmów")

Między 2005-07-01 a 2005-08-01 wyporzyczone 7380 filmów

## Zadanie 5: Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [81]:
querry_5: str = "SELECT rental_date FROM rental WHERE rental_date between '2010-01-01' AND '2011-02-01'"
film_borrowed_between_01_02 = pd.read_sql(querry_5, con=connection_sqlalchemy)
film_borrowed_between_01_02

# Między 2010-01-01 a 2011-02-01 nie wyporzyczono żadnych filmów.
print(f"Liczba filmów w tym okresie wynosi {len(film_borrowed_between_01_02)}")

Liczba filmów w tym okresie wynosi 0

## Zadanie 6: Znajdź największą płatność wypożyczenia.

In [82]:
querry_6: str = "SELECT DISTINCT ON (amount) amount, payment_id FROM payment ORDER BY amount DESC"
most_costed_rent = pd.read_sql(querry_6, con=connection_sqlalchemy)
most_costed_rent

    amount  payment_id
0    11.99       23757
1    10.99       26881
2     9.99       24573
3     9.98       32033
4     8.99       25778
5     8.97       32038
6     7.99       26045
7     7.98       32059
8     6.99       20016
9     5.99       26908
10    5.98       32084
11    4.99       24536
12    3.99       17860
13    3.98       31969
14    2.99       24801
15    1.99       25796
16    1.98       32049
17    0.99       18648
18    0.00       31920

In [83]:
print(f"Największa płatność wyporzyczenia wynosi {most_costed_rent.amount[0]}")

Największa płatność wyporzyczenia wynosi 11.99

## Zadanie 7: Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [84]:
querry_7: str = ("SELECT customer_id, first_name, last_name, country.country FROM customer\n" 
" LEFT JOIN address ON address.address_id = customer.address_id\n"
" LEFT JOIN city ON city.city_id = address.city_id\n" 
" LEFT JOIN country ON country.country_id = city.country_id\n"
" WHERE country.country='Poland' OR country.country='Nigeria' OR country.country='Bangladesh'")
customer_origin = pd.read_sql(querry_7, con=connection_sqlalchemy)
customer_origin

# Lista klientów z tych 3 krajów

    customer_id first_name  last_name     country
0           284      Sonia    Gregory     Nigeria
1           318      Brian      Wyman      Poland
2           572     Sidney   Burleson      Poland
3           409     Rodney    Moeller     Nigeria
4           332    Stephen     Qualls  Bangladesh
5           286      Velma      Lucas     Nigeria
6            80    Marilyn       Ross     Nigeria
7           198      Elsie     Kelley     Nigeria
8           103     Gladys   Hamilton     Nigeria
9           329      Frank   Waggoner  Bangladesh
10          128   Marjorie     Tucker      Poland
11           18      Carol     Garcia     Nigeria
12          270       Leah     Curtis      Poland
13          501      Ruben      Geary      Poland
14          277       Olga    Jimenez     Nigeria
15          156     Bertha   Ferguson     Nigeria
16          280     Tracey    Barrett     Nigeria
17          250         Jo     Fowler     Nigeria
18          571    Johnnie   Chisholm      Poland
19          562    Wallace      Slone     Nigeria
20           21   Michelle      Clark  Bangladesh
21          380    Russell    Brinson      Poland
22          558     Jimmie  Eggleston      Poland
23          232  Constance       Reid     Nigeria

## Zadanie 8: Gdzie mieszkają członkowie personelu?

In [85]:
# staff -> address -> city -> country
querry_8: str = ("SELECT staff_id, first_name, last_name, city.city, country.country FROM staff\n" 
" LEFT JOIN address ON address.address_id = staff.address_id\n"
" LEFT JOIN city ON city.city_id = address.city_id\n" 
" LEFT JOIN country ON country.country_id = city.country_id")
staff_life_place = pd.read_sql(querry_8, con=connection_sqlalchemy)
staff_life_place

   staff_id first_name last_name        city    country
0         1       Mike   Hillyer  Lethbridge     Canada
1         2        Jon  Stephens   Woodridge  Australia

## Zadanie 9: Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [86]:
# staff -> address -> city -> country
querry_9: str = ("SELECT country.country FROM staff\n" 
" LEFT JOIN address ON address.address_id = staff.address_id\n" 
" LEFT JOIN city ON city.city_id = address.city_id\n" 
" LEFT JOIN country ON country.country_id = city.country_id\n" 
"WHERE country.country='Spain' OR country.country='Argentina'")
staff_address = pd.read_sql(querry_9, con=connection_sqlalchemy)
staff_address


# Zaden z pracowników nie mieszka w Argentynie ani w hiszpani, To zadanie można by rozwiązać wykorzystując zapytanie z poprzedniego zadania bo mamy tylko 2 pracowników
# z których jeden mieszka w Canadzie a drugi w Argentynie

Empty DataFrame
Columns: [country]
Index: []

## Zadanie 10: Jakie kategorie filmów zostały wypożyczone przez klientów?

In [87]:
# rental -> inventory -> film -> film_category -> category
querry_10: str = ("SELECT DISTINCT category.name from rental\n" 
" LEFT JOIN inventory ON rental.inventory_id = inventory.inventory_id\n" 
" LEFT JOIN film ON film.film_id = inventory.film_id\n" 
" LEFT JOIN film_category ON film_category.film_id = film.film_id\n" 
" LEFT JOIN category ON film_category.category_id = category.category_id")
customer_tab = pd.read_sql(querry_10, con=connection_sqlalchemy)
customer_tab

           name
0        Horror
1        Comedy
2         Drama
3        Sci-Fi
4       Foreign
5      Classics
6         Games
7        Travel
8           New
9         Music
10       Action
11  Documentary
12       Sports
13    Animation
14     Children
15       Family

## Zadanie 11: Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce

In [88]:
# category.name from rental -> inventory -> film -> film_category -> category -> rental -> customer -> address -> city -> country 
querry_11: str = ("SELECT DISTINCT ON (category.name) name, category.category_id FROM rental\n" 
" LEFT JOIN inventory ON rental.inventory_id = inventory.inventory_id\n" 
" LEFT JOIN film ON film.film_id = inventory.film_id\n" 
" LEFT JOIN film_category ON film_category.film_id = film.film_id\n" 
" LEFT JOIN category ON film_category.category_id = category.category_id\n" 
" LEFT JOIN customer ON customer.customer_id = rental.customer_id\n" 
" LEFT JOIN address ON address.address_id = customer.address_id\n" 
" LEFT JOIN city ON city.city_id = address.city_id\n" 
" LEFT JOIN country ON country.country_id = city.country_id WHERE country.country='United States'")
filmed_cat_borrowed_USA = pd.read_sql(querry_11, con=connection_sqlalchemy)
filmed_cat_borrowed_USA

           name  category_id
0        Action            1
1     Animation            2
2      Children            3
3      Classics            4
4        Comedy            5
5   Documentary            6
6         Drama            7
7        Family            8
8       Foreign            9
9         Games           10
10       Horror           11
11        Music           12
12          New           13
13       Sci-Fi           14
14       Sports           15
15       Travel           16

## Zadanie 12: Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley:

In [89]:
# actor. -> film -> film_actor -> actor
querry_12: str = ("SELECT title, actor.first_name, actor.last_name FROM film\n" 
" LEFT JOIN film_actor ON film_actor.film_id = film.film_id\n" 
" LEFT JOIN actor ON actor.actor_id = film_actor.actor_id\n" 
" WHERE (actor.first_name='Olympia' AND actor.last_name='Pfeiffer') OR (actor.first_name='Julia' AND actor.last_name='Zellweger')\n" 
" OR (actor.first_name='Ellen' AND actor.last_name='Presley')")
actor_df = pd.read_sql(querry_12,con=connection_sqlalchemy)
actor_df.head(60)

                     title first_name  last_name
0          Bilko Anonymous      Ellen    Presley
1        Caribbean Liberty      Ellen    Presley
2         Casper Dragonfly      Ellen    Presley
3         Empire Malkovich      Ellen    Presley
4            Floats Garden      Ellen    Presley
5         Frogmen Breaking      Ellen    Presley
6           Homeward Cider      Ellen    Presley
7              Hyde Doctor      Ellen    Presley
8           Image Princess      Ellen    Presley
9            Jacket Frisco      Ellen    Presley
10    Microcosmos Paradise      Ellen    Presley
11            Network Peak      Ellen    Presley
12              Oscar Gold      Ellen    Presley
13          Pickup Driving      Ellen    Presley
14         Pinocchio Simon      Ellen    Presley
15            Private Drop      Ellen    Presley
16          Roots Remember      Ellen    Presley
17           Scarface Bang      Ellen    Presley
18         Secretary Rouge      Ellen    Presley
19                Spy Mile      Ellen    Presley
20    Streetcar Intentions      Ellen    Presley
21            Tadpole Park      Ellen    Presley
22        Treasure Command      Ellen    Presley
23               Turn Star      Ellen    Presley
24            Women Dorado      Ellen    Presley
25             Badman Dawn    Olympia   Pfeiffer
26             Chitty Lock    Olympia   Pfeiffer
27      Color Philadelphia    Olympia   Pfeiffer
28       Contact Anonymous    Olympia   Pfeiffer
29            Deep Crusade    Olympia   Pfeiffer
30        Effect Gladiator    Olympia   Pfeiffer
31          Express Lonely    Olympia   Pfeiffer
32       Firehouse Vietnam    Olympia   Pfeiffer
33        Fugitive Maguire    Olympia   Pfeiffer
34           Hanky October    Olympia   Pfeiffer
35            Ice Crossing    Olympia   Pfeiffer
36         Idols Snatchers    Olympia   Pfeiffer
37  Intolerable Intentions    Olympia   Pfeiffer
38      Magnolia Forrester    Olympia   Pfeiffer
39              Mars Roman    Olympia   Pfeiffer
40               Maude Mod    Olympia   Pfeiffer
41        Murder Antitrust    Olympia   Pfeiffer
42            None Spiking    Olympia   Pfeiffer
43             Others Soup    Olympia   Pfeiffer
44           Psycho Shrunk    Olympia   Pfeiffer
45             Santa Paris    Olympia   Pfeiffer
46             Sense Greek    Olympia   Pfeiffer
47         Storm Happiness    Olympia   Pfeiffer
48       Sweet Brotherhood    Olympia   Pfeiffer
49        Titanic Boondock    Olympia   Pfeiffer
50         Tourist Pelican    Olympia   Pfeiffer
51          Traffic Hobbit    Olympia   Pfeiffer
52              Wait Cider    Olympia   Pfeiffer
53    Breakfast Goldfinger      Julia  Zellweger
54        Cranes Reservoir      Julia  Zellweger
55             Dares Pluto      Julia  Zellweger
56        Detective Vision      Julia  Zellweger
57         Divorce Shining      Julia  Zellweger
58         Hollow Jeopardy      Julia  Zellweger
59         Jeopardy Encino      Julia  Zellweger